package homework2.arrayProblems;

public class MaximumOnesRow {
    /*
    Вам дается двумерный массив, состоящий их 0 и 1.
    Ваша задача вернуть ряд, в котором содержится
    максимальное количество 1, если такой ряд отсутствует
    (во всех рядах количество 1 одинаково) то вернуть -1.

    Ввод: [[1, 0, 1, 0], [0, 0, 0, 0], [1, 1, 1, 0], [0, 0, 1, 0]];
    Вывод: [1, 1, 1, 0]

    Ввод: [[0, 0, 1, 0, 0, 0], [0, 1, 0, 0, 0, 0], [1, 0, 0, 0, 0, 0]]
    Вывод: -1
     */
    public static void main(String[] args) {

    }
}
